Repository: realh/roxterm
Catalog: po4a/guide.html.*.po
Languages: fr

source: en-US
fr: fr-FR

source: <a id="MainNav_Home" href="index.html">Home</a>
fr: <a id="MainNav_Home" href="index.html">Accueil</a>

source: <a id="MainNav_News" href="news.html">News</a>
fr: <a id="MainNav_News" href="news.html">Nouveautés</a>

source: <a id="MainNav_UserGuide" class="active" href="#">User Guide</a>
fr: <a id="MainNav_UserGuide" class="active" href="#">Guide Utilisateur</a>

source: <a href="#URIHighlighting">URI Highlighting</a>
fr: <a href="#URIHighlighting">Soulignement des URI</a>

source: <a href="#KeyboardShortcuts">Keyboard Shortcuts</a>
fr: <a href="#KeyboardShortcuts">Raccourcis clavier</a>

source: <a href="#ConfigurationManagement">Configuration Management</a>
fr: <a href="#ConfigurationManagement">Gestion de la configuration</a>

source: <a href="#CommandlineOptions">Command-line Options</a>
fr: <a href="#CommandlineOptions">Options de la ligne de commande</a>

source: <a href="#AdvancedDbusUsage">Advanced D-bus Usage</a>
fr: <a href="#AdvancedDbusUsage">Utilisation avancée de D-bus</a>

source: User Guide
fr: Guide Utilisateur

source: Each window can contain a number of tabs, each with its own terminal. Unlike gnome-terminal and earlier versions of ROXTerm, the tab bar is always shown by default, even if there is only one tab, to avoid resizing inconsistencies, but this is configurable.
fr: Chaque fenêtre peut contenir plusieurs onglets, chacun dans son propre terminal. Contrairement à gnome-terminal et aux versions précédentes de ROXTerm, la barre d'onglets est toujours visible par défaut, même s'il n'y a qu'un onglet, afin d'éviter les inconsistances au redimensionnement, mais cela est configurable.

source: When the menu bar is hidden the popup menu duplicates the same items as in the menu bar; this gives you full access to all the functions with the menu bar hidden. The menu bar is effectively redundant but provided to make ROXTerm appear more straightforward for first-time users. It can be turned on and off for a particular window or more permanently by using the configuration manager.
fr: Quand la barre de menu est cachée, le menu popup duplique les mêmes items que dans la barre de menu : cela vous donne un accès complet à toutes les fonctions avec la barre de menu cachée. La barre de menu est effectivement redondante mais cela est fait pour rendre ROXTerm plus facile aux nouveaux utilisateurs. Cela peut être activé ou désactivé pour une fenêtre particulière ou de façon plus permanente à l'aide du gestionnaire de configuration.

source: The popup menu also allows email and web addresses to be opened in external applications if such an address is highlighted by the pointer being over it.
fr: Le menu contextuel permet également d'ouvrir les adresses électroniques et Web dans des applications externes si une telle adresse est mise en surbrillance par le curseur au dessus d'elle.

source: URI Highlighting <a class="pageAnchor" name="URIHighlighting">:</a>
fr: Soulignement des URI <a class="pageAnchor" name="URIHighlighting">:</a>

source: When the pointer is over an address that ROXTerm recognises as a URI (typically a web URL or email address) it is highlighted by underlining and a change of pointer shape. You can open the address either by right-clicking on it and choosing Open... in the menu or by holding Ctrl and left-clicking. The applications used to handle these addresses may be set with the configuration tool, otherwise it will try to find a suitable default. Also by holding Ctrl you can drag a URI to pass it to another application which is willing to accept it as a URI or text; dragging it into the same window it came from pastes the address back in.
fr: Quand le pointeur est au-dessus d'une adresse que ROXTerm reconnait comme URI (typiquement une URL web ou un email), elle est mise en évidence par un soulignement et un changement de la forme du pointeur. Vous pouvez ouvrir l'adresse soit en cliquant droit et en choisissant Ouvrir... dans le menu ou en maintenant Ctrl et en cliquant gauche. Les applications utilisées pour manipuler ces adresses peuvent être déterminées avec l'outil de configuration, sinon il sera essayé de trouver une application convenable par défaut. Également en maintenant Ctrl, vous pouvez tirer une URI pour la passer à une autre application capable de l'accepter comme URI ou texte ; la tirer dans la fenêtre d'où elle vient colle l'adresse en retour.

source: Note that if the pointer is over the server address portion of a URL it only highlights the address, omitting the filename; move the pointer over the filename to get the whole URL. Similarly you can highlight an email address with or without a leading mailto:.
fr: Notez que, si le pointeur est au-dessus de la portion d'une URL correspondant à l'adresse du serveur, il met en évidence l'adresse seulement, sans le nom de fichier ; déplacez le pointeur sur le nom de fichier pour obtenir l'URL complète. De le même façon, vous pouvez mettre en évidence une adresse mail avec ou sans le mailto: qui précède.

source: You can now drag items onto terminal windows. Text objects are fed to the terminal as if typed. Files and URIs have their location (filename or URI) fed in rather than the object's contents. Graphical files can also be dragged onto the appropriate area of the configuration manager to set terminal background images. Holding down Ctrl while dragging a highlighted URI allows the address to be dragged to another application.
fr: Vous pouvez maintenant faire glisser des éléments sur les fenêtres de terminal. Les objets texte sont insérés dans le terminal comme s'ils étaient tapés. Les fichiers et les URI ont leur emplacement (nom de fichier ou URI) insérés plutôt que le contenu des objets. Les fichiers graphiques peuvent également être glissés sur la zone appropriée du gestionnaire de configuration pour définir les images de fond des terminaux. Maintenir la touche Ctrl tout en faisant glisser un URI en surbrillance permet de faire glisser l'adresse vers une autre application.

source: You can now drag tabs by their labels to reorder them within a window or to move them to another ROXTerm window or, by dropping them outside a ROXTerm window, move tabs to new windows of their own. Use mouse button 3 (the right button) to move an unselected tab without selecting it. Note that versions prior to 1.9 used button 2 (middle). Button 2 is now a shortcut to paste the contents of the clipboard as the tab's name.
fr: Vous pouvez maintenant faire glisser les onglets par leurs étiquettes pour les réorganiser dans une fenêtre ou de les déplacer vers une autre fenêtre ROXTerm ou, en les déposant à l'extérieur d'une fenêtre ROXTerm, déplacer les onglets de nouvelles fenêtres en propre. Utilisez le bouton 3 de la souris (bouton de droite) pour déplacer un onglet non sélectionné sans le sélectionner. Notez que les versions antérieures à 1.9 utilisaient le bouton 2 (intermédiaire). Le bouton 2 est maintenant un raccourci pour coller le contenu du presse-papiers comme le nom de l'onglet.

source: Configuration is based on named profiles so you can save different sets of options and switch between them quickly. There are profiles for general options, colour schemes and keyboard shortcuts (sometimes also referred to as accelerators). Colour Schemes and Profiles apply to one tab at a time, but Keyboard Shortcuts apply to all tabs in the same window to avoid the potential for confusion from different tabs having different shortcuts for switching tabs. New windows and tabs inherit settings from the window/tab they were opened from.
fr: Configuration est basée sur les profils nommés de sorte que vous pouvez enregistrer différents ensembles d'options et basculer entre eux rapidement. Il existe des profils pour les options générales, les couleurs et les raccourcis clavier (parfois aussi appelés accélérateurs). Jeux de couleurs et profils s'appliquent à un onglet à la fois, mais les raccourcis clavier s'appliquent à tous les onglets de la même fenêtre afin d'éviter le risque de confusion de différents onglets présentant des raccourcis différents pour changer d'onglet. Les nouvelles fenêtres et onglets héritent des paramètres de la fenêtre/onglet d'où ils ont été ouverts.

source: Prior to version 1.15.1 all tabs had to share the same Profile, but this has been changed. In consequence a profile's font and other settings which affect a terminal's size may be overridden to keep geometry consistent across a number of tabs in one window.
fr: Avant la version 1.15.1, tous les onglets devaient partager le même profil, mais cela a été changé. En conséquence, la police d'un profil et d'autres paramètres qui influent sur la taille d'un terminal peuvent être remplacés pour maintenir une géométrie cohérente à travers un certain nombre d'onglets dans une même fenêtre.

source: The Preferences menu allows you to select the current profile etc (this setting will not be remembered; use the configuration manager to set the defaults), open the configuration manager to edit the current profile or colour scheme or to manage all settings. In the configuration manager you can select one of the four types of option groups and edit, copy, delete or rename it. Each item also has a radio button. The item with the selected radio is the default for new terminals. Note that character encodings are handled slightly differently.
fr: Le menu Préférences vous permet de sélectionner le profil etc courant (ce paramètre ne sera pas mémorisé ; utiliser le gestionnaire de configuration pour définir les paramètres par défaut), d'ouvrir le gestionnaire de configuration pour modifier le profil actuel ou de couleur ou de gérer tous les paramètres. Dans le gestionnaire de configuration, vous pouvez sélectionner l'un des quatre types de groupes d'options et le modifier, le copier, le supprimer ou le renommer. Chaque élément dispose également d'un bouton radio. L'élément avec le bouton radio coché est le défaut pour les nouveaux terminaux. Notez que les codages de caractères sont traités de façon légèrement différente.

source: Keyboard Shortcuts <a class="pageAnchor" name="KeyboardShortcuts">:</a>
fr: Raccourcis clavier <a class="pageAnchor" name="KeyboardShortcuts">:</a>

source: Configuration Management <a class="pageAnchor" name="ConfigurationManagement">:</a>
fr: Gestion de la configuration <a class="pageAnchor" name="ConfigurationManagement">:</a>

source: You can also run the configuration manager by selecting "Configure..." in ROX's menu for the ROXTerm application or by running roxterm-config if ROXTerm has been installed conventionally.
fr: Vous pouvez également exécuter le gestionnaire de configuration en sélectionnant "Configurer..." dans le menu de ROX pour l'application ROXTerm ou en exécutant roxterm-config si ROXTerm a été installé de manière classique.

source: Configuration files can easily be swapped with other users. Each profile, colour scheme and keyboard shortcut scheme has a single file associated with it; saving a valid file in the appropriate directory will create a profile etc with the same name as the file.
fr: Les fichiers de configuration peuvent facilement être échangés avec d'autres utilisateurs. Chaque profil, couleurs et raccourci clavier régime dispose d'un fichier unique qui lui est associé ; enregistrer un fichier valide dans le répertoire approprié permet de créer un profil, etc avec le même nom que le fichier.

source: The directory locations for these configuration files follow the XDG Base Directory specification. In descending order of priority they are:
fr: Les emplacements de répertoires pour ces fichiers de configuration suivent la spécification "XDG Base Directory". Dans l'ordre décroissant de priorité, ce sont :

source: <span>${XDG_CONFIG_HOME}/roxterm.sourceforge.net defaulting to ~/.config/roxterm.sourceforge.net</span>
fr: <span>${XDG_CONFIG_HOME}/roxterm.sourceforge.net par défaut dans ~/.config/roxterm.sourceforge.net</span>

source: <span>${XDG_CONFIG_DIRS}/roxtem.sourceforge.net defaulting to /etc/xdg/roxtem.sourceforge.net</span>
fr: <span>${XDG_CONFIG_DIRS}/roxtem.sourceforge.net par défaut dans /etc/xdg/roxtem.sourceforge.net</span>

source: <span>ROXTerm/Config for ROX users, or ${datadir}/roxterm/Config for others; ${datadir} is usually /usr/share for packages or /usr/local/share when compiled from source</span>
fr: <span>ROXTerm/Config pour les utilisateurs de ROX, ou ${datadir}/roxterm/Config pour les autres ; ${datadir} est habituellement /usr/share pour les paquets ou /usr/local/share lorsqu'il est compilé depuis les sources</span>

source: Within any or each of those locations, profiles are saved in a "Profiles" subdirectory, colour schemes in "Colours" and keyboard shortcut schemes in "Shortcuts". A file called "Globals" contains miscellaneous options which don't fall into the above categories, including the default profile etc for new terminals.
fr: Dans un ou chacun de ces emplacements, les profils sont enregistrés dans un sous-répertoire "Profils", les modèles de couleurs dans "Couleurs" et les jeux de raccourcis clavier dans «Raccourcis». Un fichier appelé "Globals" contient diverses options qui n'entrent pas dans les catégories ci-dessus, y compris le profil par défaut pour les nouveaux terminaux, etc.

source: Command-line Options <a class="pageAnchor" name="CommandlineOptions">:</a>
fr: Options de la ligne de commande <a class="pageAnchor" name="CommandlineOptions">:</a>

source: ROXTerm accepts a number of command-line options. Run:
fr: ROXTerm accepte un certain nombre d'options de ligne de commande. Lancer :

source: for a full list.
fr: pour une liste complète.

source: From version 1.1.0 ROXTerm defaults to using only one process for all terminals so that you can drag tabs between windows. If you run the command again it sends a D-BUS message to the existing process to signal it to open a new terminal, and the second process exits. To make a roxterm command run in its own separate process use the --separate option.
fr: Depuis la version 1.1.0, ROXTerm par défaut utilise un seul processus pour tous les terminaux de sorte que vous pouvez faire glisser les onglets entre fenêtres. Si vous exécutez la commande de nouveau, il envoie un message D-BUS pour le processus existant pour signaler d'ouvrir un nouveau terminal, et le second processus se termine. Pour faire qu'une commande roxterm tourne dans son propre processus distinct, utilisez l'option --separate.

source: Note that the --colour_scheme and --shortcut_scheme options have been replaced by --colour-scheme and --shortcut-scheme respectively in 1.7.0 (underscores changed to hyphens) but the old versions remain usable for backwards compatibility.
fr: Notez que les options --colour_scheme et --shortcut_scheme ont été remplacés par --colour-scheme et --shortcut-scheme respectivement dans la version 1.7.0 (soulignés changés en traits d'union), mais les anciennes versions restent utilisables pour la compatibilité ascendante.

source: Advanced D-Bus Usage <a class="pageAnchor" name="AdvancedDbusUsage">:</a>
fr: Utilisation avancée de D-bus <a class="pageAnchor" name="AdvancedDbusUsage">:</a>

source: From version 1.14.0 advanced users can use D-Bus to configure terminals from other applications and scripts. There are three D-Bus methods especially for this purpose; they require an id code to target a specific terminal; each terminal's id code can be read from the environment variable ROXTERM_ID in the shell/application running in it. The D-Bus object path and interface for the methods are "net.sf.roxterm.Options" and "/net/sf/roxterm/Options" respectively. The methods are:
fr: Depuis la version 1.14.0, les utilisateurs avancés peuvent utiliser D-Bus pour configurer les terminaux depuis d'autres applications ou de scripts. Il existe trois méthodes D-Bus spécialement prévues à cette fin, elles ont besoin d'un code d'identification pour cibler un terminal spécifique; le code d'identification de chaque terminal peut être lu à partir de la variable d'environnement ROXTERM_ID dans le shell/application fonctionnant en elle. Le chemin de l'objet D-Bus et l'interface pour les méthodes sont "net.sf.roxterm.Options" et "/net/sf/roxterm/Options" respectivement. Les méthodes sont les suivantes :

source: SetProfile("id", "profile_name")
fr: SetProfile("id", "nom_du_profil")

source: Ask the terminal to use the named profile. Note that any other tabs in the same window will be updated to the same new profile. All tabs in one window must have the same profile so that their font size and therefore terminal size remain consistent.
fr: Demander au terminal d'utiliser le profil indiqué. Notez que tous les autres onglets dans la même fenêtre seront mises à jour avec même profil. Tous les onglets dans une fenêtre doivent avoir le même profil de sorte que la taille de leur police, et donc la taille du terminal, reste cohérente.

source: SetColourScheme("id", "scheme_name")
fr: SetColourScheme("id", "nom_du_schema")

source: Ask the terminal to use the named colour scheme. Tabs sharing the same window may have different colour schemes from each other.
fr: Demandez au terminal d'utiliser le jeu de couleurs nommé. Les onglets qui partagent la même fenêtre doivent également partager le même jeu de couleurs.

source: SetShortcutScheme("id", "scheme_name")
fr: SetShortcutScheme("id", "nom_du_schema")

source: Ask the terminal to use the named keyboard shortcut scheme. Tabs sharing the same window must also share the same shortcut scheme.
fr: Demandez au terminal d'utiliser le jeu de raccourcis clavier nommé. Les onglets qui partagent la même fenêtre doivent également partager le même jeu de raccourcis clavier.

source: Example using dbus-send in a shell script:
fr: Exemple utilisant dbus-send dans un script shell :

source: You may also send D-Bus signals to change individual options within a named profile or colour scheme using the methods StringOption, IntOption (also used for boolean options) and FloatOption. All terminals using the named profile or colour scheme are affected, but only temporarily. The options are not saved for new terminals. The methods all take 3 arguments:
fr: Vous pouvez également envoyer des signaux D-Bus pour modifier les options individuelles dans un système de profil nommé ou dans un jeu de couleurs en utilisant les méthodes StringOption, IntOption (également utilisé pour les options booléennes) et FloatOption. Tous les terminaux utilisant le profil nommé ou le jeu de couleur sont touchés, mais seulement temporairement. Les options ne sont pas enregistrées pour les nouveaux terminaux. Les méthodes prennent tous trois arguments :

source: <span>Full profile name, including a prefix of "Profiles/" or "Colours/"</span>
fr: <span>Nom complet du profil, incluant un préfixe de "Profiles/" ou "Colours/"</span>

source: <span>Option name</span>
fr: <span>Nom de l'option</span>

source: <span>Value</span>
fr: <span>Valeur</span>

source: To see which option names you can use, check the config files, from which the types can be deduced.
fr: Pour voir les noms d'options que vous pouvez utiliser, consultez les fichiers de configuration, à partir desquels les types peuvent être déduits.

source: A third possible use is to notify roxterm that a profile, colour scheme or shortcuts scheme has been changed by an external program and all terminals using that profile etc need to reload it:
fr: Un troisième utilisation possible consiste à notifier à ROXTerm qu'un profil, un jeu de couleurs ou un jeu de raccourcis a été modifiée par un programme externe et que tous les terminaux utilisant le profil, etc, ont besoin de le recharger :

source: OptionsChanged("family_name", "profile_name")
fr: OptionsChanged("nom_de_famille", "nom_du_profil")

source: where family_name is one of "Profiles", "Colours" or "Shortcuts". For example:
fr: lorsque nom_de_famille est "Profiles", "Colours" ou "Shortcuts". Par exemple :

source: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Donate</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">Valid XHTML</a>
fr: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Faire un don</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">XHTML valide</a>

source: ROXTerm is licensed under the <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site design by Adrian Sampson
fr: ROXTerm est publié sous licence <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site conçu par Adrian Sampson
