Repository: realh/roxterm
Catalog: po4a/index.html.*.po
Languages: fr

source: en-US
fr: fr-FR

source: <a id="MainNav_Home" class="active" href="#">Home</a>
fr: <a id="MainNav_Home" class="active" href="#">Accueil</a>

source: <a id="MainNav_News" href="news.html">News</a>
fr: <a id="MainNav_News" href="news.html">Nouveautés</a>

source: <a id="MainNav_UserGuide" href="guide.html">User Guide</a>
fr: <a id="MainNav_UserGuide" href="guide.html">Guide d'utilisateur</a>

source: Welcome
fr: Bienvenue

source: ROXTerm is a terminal emulator intended to provide similar features to gnome-terminal, based on the same VTE library. It was originally designed to have a smaller footprint and quicker start-up time by not using the Gnome libraries and by using a separate applet to provide the configuration GUI, but thanks to all the features it's acquired over the years ROXTerm can probably now be accused of bloat. However, it is more configurable than gnome-terminal and aimed more at "power" users who make heavy use of terminals.
fr: ROXTerm est un émulateur de terminal destiné à fournir des fonctionnalités similaires à gnome-terminal, basé sur la même bibliothèque VTE. Il a été initialement conçu pour avoir une plus petite empreinte et des temps de démarrage plus rapide en n'utilisant pas les bibliothèques Gnome et en utilisant un applet séparé pour fournir la configuration GUI, mais grâce à toutes les fonctions qu'il a acquis au fil des années ROXTerm peut sans doute être maintenant considéré comme puissant. Cependant, il est plus configurable que gnome-terminal et vise plus les powers-utilisateurs qui font un usage intensif des terminaux.

source: It can be used as a ROX application, as the name implies, or in any other X environment.
fr: Il peut être utilisé comme une application ROX, comme son nom l'indique, ou dans tout autre environnement X.

source: Get RoxTerm at SourceForge.net. Fast, secure and Free Open Source software downloads
fr: Obtenez RoxTerm sur SourceForge.net. Rapide, sécurisé et téléchargements de logiciels Libres Open-Source

source: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Donate</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">Valid XHTML</a>
fr: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Donate</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">XHTML Valide</a>

source: ROXTerm is licensed under the <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site design by Adrian Sampson
fr: ROXTerm est sous licence <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site conçu par Adrian Sampson
