Repository: realh/roxterm
Catalog: po4a/installation.html.*.po
Languages: fr

source: en-US
fr: fr-FR

source: <a id="MainNav_Home" href="index.html">Home</a>
fr: <a id="MainNav_Home" href="index.html">Accueil</a>

source: <a id="MainNav_News" href="news.html">News</a>
fr: <a id="MainNav_News" href="news.html">Nouveautés</a>

source: <a id="MainNav_UserGuide" href="guide.html">User Guide</a>
fr: <a id="MainNav_UserGuide" href="guide.html">Guide utilisateur</a>

source: <a href="#Download">Download</a>
fr: <a href="#Download">Téléchargement</a>

source: <a href="#Requirements">Requirements</a>
fr: <a href="#Requirements">Configuration nécessaire</a>

source: <a href="#Installing">Installing</a>
fr: <a href="#Installing">Installation</a>

source: Download <a class="pageAnchor" name="Download">:</a>
fr: Téléchargement <a class="pageAnchor" name="Download">:</a>

source: Visit the <a href="http://sourceforge.net/projects/roxterm">SourceForge project page</a> to download release files or use other Sourceforge tools. If you want to get developmental versions ahead of releases, use git. For versions prior to 1.19.0 use svn (subversion). The actual command you will probably want to use to check out a snapshot is:
fr: Visitez la <a href="http://sourceforge.net/projects/roxterm">page SourceForge du projet</a> pour télécharger les fichiers ou utiliser d'autres outils de Sourceforge. Si vous souhaitez obtenir les dernières versions de développement à venir, utilisez git. Pour les versions antérieures à 1.19.0 utilisez svn (Subversion). La commande actuelle, que vous voudrez probablement utiliser pour obtenir un instantané est la suivante :

source: Requirements <a class="pageAnchor" name="Requirements">:</a>
fr: Configuration nécessaire <a class="pageAnchor" name="Requirements">:</a>

source: You need the libraries for GTK+2 which is pretty much standard on all free Unix derivatives these days, and/or GTK+3. It needs at least version 2.16 of glib and GTK+ 2.18. You will also need vte/libvte (at least version 0.20), a Gnome component; most distros package separate versions for GTK+2 and GTK+3. D-BUS is also required (see below).
fr: Vous avez besoin des bibliothèques pour GTK+2 qui est assez standard sur tous les dérivés d'Unix libre pour le moment, et / ou GTK+3. Il faut au moins la version 2.16 de glib et GTK+ 2.18. Vous aurez aussi besoin de vte / libvte (au moins la version 0.20), un composant Gnome ; la plupart des paquets de distributions séparent les pour GTK+2 et GTK+3. D-BUS est également nécessaire (voir ci-dessous).

source: To compile ROXTerm you will need the header files for the above libraries. In packaging systems they usually come in packages whose names end in "-dev" or "-devel".
fr: Pour compiler ROXTerm vous aurez besoin des fichiers d'en-tête pour les bibliothèques ci-dessus. Dans les systèmes d'empaquetage, ils sont généralement fournis dans des paquets dont les noms se terminent par "-dev" ou "-devel".

source: ROXTerm uses a new, bespoke build system called maitch. This requires python and the python 'lockfile' module.
fr: ROXTerm utilise un nouveau système de compilation sur mesure appelé maitch qui nécessite python et le module 'lockfile" pour python.

source: D-Bus is a messaging system which ROXTerm uses to connect terminals with its configure tool. ROXTerm uses the "session" bus, which should be started along with your desktop environment. Current versions of ROX, GNOME and KDE session managers all launch D-Bus. If you use some other session/desktop/window manager which doesn't launch D-Bus you can start it by inserting something like this near the start of your .xinitrc or .xsession:
fr: D-Bus est un système de messagerie qu'utilise ROXTerm pour connecter les terminaux avec son outil de configuration. ROXTerm utilise le bus de "session", qui devrait avoir été lancé en même temps que votre environnement de bureau. Les versions actuelles des gestionnaires de session de ROX, GNOME et KDE lancement tous D-Bus. Si vous utilisez une autre session / bureau / gestionnaire de fenêtre qui ne lance pas D-Bus vous pouvez le démarrer en insérant quelque chose comme cela au début de votre .xinitrc ou .xsession :

source: The reason for using a bespoke configuration messaging system over D-Bus instead of gconf is because gconf doesn't provide a way to map an arbitrary number of profiles onto configuration filenames.
fr: La raison pour utiliser un système de configuration sur mesure de messagerie par dessus D-Bus au lieu de gconf est justifier du fait que gconf ne fournit pas de moyen d'allouer un nombre arbitraire de profils dans les fichiers de configuration.

source: Installing <a class="pageAnchor" name="Installing">:</a>
fr: Installation <a class="pageAnchor" name="Installing">:</a>

source: To install ROXTerm for ROX all you need to do is unpack the tarball in your Apps directory and run it from there, but you will probably want to rename the folder to ROXTerm. For other systems ROXTerm may be installed in a similar way to an autoconf-based source package, but using maitch's analogues:
fr: Pour installer ROXTerm pour ROX tout ce que vous devez faire est de décompresser l'archive dans votre répertoire d'applications et le lancer à partir de là, mais vous voudrez probablement renommer le dossier en ROXTerm. Pour les autres systèmes ROXTerm peut être installé d'une manière semblable à un paquet source basé sur autoconf, mais en utilisant maitch en parallèle :

source: Various options are available, run
fr: Diverses options sont disponibles, lancer

source: for details.
fr: pour les détails.

source: Autoconf builds are no longer supported.
fr: La compilation par autoconf n'est plus prise en charge.

source: Up-to-date official Debian packages are now available. See <a href="http://packages.debian.org/roxterm">http://packages.debian.org/roxterm</a>.
fr: Une mise à jour du paquet Debian officiel est disponible. Consulter <a href="http://packages.debian.org/roxterm">http://packages.debian.org/roxterm</a>.

source: Ubuntu also has official roxterm packages, but due to Ubuntu's release cycle these may lag behind the latest upstream releases. Therefore I have set up a <a href="https://launchpad.net/~h-realh/+archive/roxterm">PPA</a> to provide the most recent releases of ROXTerm for Ubuntu's current release when appropriate.
fr: Ubuntu a aussi les paquets officiels de ROXTerm, mais en raison du cycle de publication d'Ubuntu ceux-ci peuvent être en retard sur les dernières versions en amont. Par conséquent, j'ai mis en place un <a href="https://launchpad.net/~h-realh/+archive/roxterm">PPA</ a> pour fournir les versions les plus récentes de ROXTerm pour la dernière version d'Ubuntu, le cas échéant.

source: For those that want to build their own debian packages, the debian packaging files are no longer included in release tarballs, but they are included in git's master branch. <a href="Download">See above</a> for details of how to fetch roxterm from git.
fr: Pour ceux qui veulent construire leurs propres paquets Debian, les fichiers de paquets Debian ne sont plus inclus dans des archives compressées publiées, mais elles sont incluses dans la branche master de git. <a href="Download">Voir ci-dessus</ a> pour plus de détails sur la façon de d'obtenir ROXTerm à partir de git.

source: If you want to build a particular version:
fr: Si vous souhaitez compiler une version particulière :

source: For older distros which do not include packages of GTK3 etc:
fr: Pour les anciennes distributions qui n'incluent pas les paquets pour GTK3 etc :

source: You can use <code>sudo apt-get build-dep</code> at this point, but depending on the version already in your distro the set of packages may be out-of-date, so be prepared for dependency errors later and install the necessary packages at that point. You should install imagemagick and librsvg2-bin at this point, but these are bugged in Ubuntu Lucid (and earlier?), so before building you will have to copy these files from <code>Help/lib</code> in a tarball: <code>roxterm_logo.png favicon.ico logo_text.png</code>.
fr: A ce stade, vous pouvez utiliser <code>sudo apt-get build-dep</ code> mais, en fonction de la version déjà dans votre distribution, les paquets peuvent ne pas être à jour, alors attendez-vous à des erreurs de dépendance et à devoir installer les paquets nécessaires à ce moment. Vous devez installer imagemagick et librsvg2-bin à ce point, mais ceux-ci sont bogués dans Ubuntu Lucid (et avant ?) donc, avant de faire le build, vous devrez copier ces fichiers à partir <code>Help/lib</ code> dans une archive : <code>roxterm_logo.png favicon.ico logo_text.png</ code>.

source: If not using a release snapshot it's a good idead to use <code>dch</code> to ensure the newest version number in <code>debian/changelog</code> has an appropriate version number eg what <code>./mscript.py configure</code> generates in the file <code>version</code>, based on the output of <code>git describe</code>. Now you can build the packages eg with <code>debuild -b -uc -us</code>. Note the <code>-b</code>:- only binary packages can be built in the absence of an orig tarball.
fr: Si vous n'utilisez pas une release snapshot, c'est une bonne idée d'utiliser <code>dch</code> pour s'assurer que le numéro de version le plus récent dans <code>debian/changelog</code> a un numéro de version approprié, par exemple ce que <code>./mscript.py configure</code> génère dans le fichier <code>version</code>, basé sur la sortie de <code>git describe</ code>. Maintenant, vous pouvez construire les paquets par exemple avec <code>debuild -b -uc -us</ code>. Remarque <code>-b</code> : - seuls les paquets binaires peuvent être construits en l'absence d'une archive orig.

source: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Donate</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">Valid XHTML</a>
fr: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Faire un don</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">XHTML valide</a>

source: ROXTerm is licensed under the <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site design by Adrian Sampson
fr: ROXTerm est publié sous licence <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site conçu par Adrian Sampson
