Repository: realh/roxterm
Catalog: po4a/news.html.*.po
Languages: fr

source: en-US
fr: fr-FR

source: <a id="MainNav_Home" href="index.html">Home</a>
fr: <a id="MainNav_Home" href="index.html">Accueil</a>

source: <a id="MainNav_News" class="active" href="#">News</a>
fr: <a id="MainNav_News" class="active" href="#">Nouveautés</a>

source: <a id="MainNav_UserGuide" href="guide.html">User Guide</a>
fr: <a id="MainNav_UserGuide" href="guide.html">Guide utilisateur</a>

source: News
fr: Nouveautés

source: <span>Terminal background options are disabled when using a recent version of VTE which deprecates them.</span>
fr: <span>Les options d'arrière-plan du terminal sont désactivées avec les versions récentes de VTE, qui les rendent obsolètes.</span>

source: <span>Translations are now enabled.</span>
fr: <span>Les traductions sont maintenant activées.</span>

source: <span>New behaviour for -e (see man page).</span>
fr: <span>Nouveau comportement pour -e (voir page de man).</span>

source: <span>Several new features and bug-fixes.</span>
fr: <span>Plusieurs nouvelles fonctionnalités et corrections de bogues.</span>

source: <span class="newsItemHeader">2012-02-24</span> <span class="newsItemSubHeader">Version 2.5.1</span>
fr: <span class="newsItemHeader">24-02-2012</span> <span class="newsItemSubHeader">Version 2.5.1</span>

source: <span>Improved close window/tab warning options.</span>
fr: <span>Options d'avertissement à la fermeture de fenêtre/onglet améliorées.</span>

source: <span>Implemented dark theme option.</span>
fr: <span>Implémentation d'une option de thème sombre.</span>

source: <span>Ubuntu PPA moved to <a href="https://launchpad.net/~h-realh/+archive/roxterm"> https://launchpad.net/~h-realh/+archive/roxterm</a></span>
fr: <span>PPA Ubuntu déplacé vers <a href="https://launchpad.net/~h-realh/+archive/roxterm"> https://launchpad.net/~h-realh/+archive/roxterm</a></span>

source: <span class="newsItemHeader">2011-11-24</span> <span class="newsItemSubHeader">Version 2.3.1</span>
fr: <span class="newsItemHeader">24-11-2011</span> <span class="newsItemSubHeader">Version 2.3.1</span>

source: <span class="newsItemHeader">2011-08-21</span> <span class="newsItemSubHeader">Version 2.0.1</span>
fr: <span class="newsItemHeader">21-08-2011</span> <span class="newsItemSubHeader">Version 2.0.1</span>

source: <span>Uses GTK+3 by default, GTK+2 support still available.</span>
fr: <span>Utilise GTK+3 par défaut, support de GTK+2 encore disponible.</span>

source: <span>Added search functionality.</span>
fr: <span>Fonctionnalités de recherche ajoutées.</span>

source: <span>Added support for file URIs.</span>
fr: <span>Support d'URI de fichiers ajouté.</span>

source: <span>Much improved tab bar.</span>
fr: <span>Barre d'onglets nettement améliorée.</span>

source: <span>Uses GtkBuilder instead of libglade.</span>
fr: <span>Utilise GtkBuilder à la place de libglade.</span>

source: <span class="newsItemHeader">2011-06-02</span> <span class="newsItemSubHeader">Version 1.22.1</span>
fr: <span class="newsItemHeader">02-06-2011</span> <span class="newsItemSubHeader">Version 1.22.1</span>

source: <span>Improved compositing support.</span>
fr: <span>Support de compositeur améliorét.</span>

source: <span>Added --role option.</span>
fr: <span>Option --role ajoutée.</span>

source: <span>--xclass and --xname options removed. --name and/or --class are alternatives but should be used in conjunction with --separate. Use --role if you need a per-window identifier.</span>
fr: <span>Les options --xclass and --xname sont supprimées. --name and/or --class sont les alternatives mais doivent être utilisées en conjunction avec --separate. Utilisez --role si vous avez besoin d'une identification par fenêtre.</span>

source: <span class="newsItemHeader">2011-02-12</span> <span class="newsItemSubHeader">Version 1.21.1</span>
fr: <span class="newsItemHeader">12-02-2011</span> <span class="newsItemSubHeader">Version 1.21.1</span>

source: <span>Window title can be configured in profiles.</span>
fr: <span>Le titre de fenêtre peut être configuré dans les profils.</span>

source: <span class="newsItemHeader">2010-11-17</span> <span class="newsItemSubHeader">Version 1.20.0</span>
fr: <span class="newsItemHeader">17-11-2010</span> <span class="newsItemSubHeader">Version 1.20.0</span>

source: <span>Improved terminal geometry management.</span>
fr: <span>Gestion améliorée de la géométrie du terminal.</span>

source: <span>Changes to tab/window title handling.</span>
fr: <span>Changements dans la façon de manipuler le titre des fenêtre/onglet.</span>

source: <span class="newsItemHeader">2010-09-21</span> <span class="newsItemSubHeader">Version 1.19.1</span>
fr: <span class="newsItemHeader">21-09-2010</span> <span class="newsItemSubHeader">Version 1.19.1</span>

source: <span>New website design by Cameron Sampson.</span>
fr: <span>Nouveau site web conçu par Cameron Sampson.</span>

source: <span>Spanish translation by F&eacute;lix Medrano Sanz.</span>
fr: <span>Traduction espagnol par F&eacute;lix Medrano Sanz.</span>

source: <span>Rewritten code for multiple tab management.</span>
fr: <span>Code ré-écrit pour la gestion des onglets multiples.</span>

source: <span class="newsItemHeader">2010-03-23</span> <span class="newsItemSubHeader">Version 1.18.1</span>
fr: <span class="newsItemHeader">23-23-2010</span> <span class="newsItemSubHeader">Version 1.18.1</span>

source: <span>Rudimentary ssh support.</span>
fr: <span>Support rudimentaire de ssh.</span>

source: <span>Profile editor redesign, including new fullscreen &amp; maximise options.</span>
fr: <span>Redesign de l'éditeur de profil, incluant les nouvelles option de plein écran &amp; de maximisation.</span>

source: <span>New menu items to open a terminal with a specific profile.</span>
fr: <span>Nouveaux éléments de menu pour ouvrir un terminal avec un profil specifique.</span>

source: <span>Ability to restart a command.</span>
fr: <span>Possibilité de redémarrer une commande.</span>

source: <span>Always show tabs is on by default and single tabs only take up as much space as they need.</span>
fr: <span>Toujours montrer les onglets est par défaut et les onglets uniques occupent autant de place que nécessaire.</span>

source: <span class="newsItemHeader">2008-09-13</span> <span class="newsItemSubHeader">Version 1.13.0</span>
fr: <span class="newsItemHeader">13-09-2008</span> <span class="newsItemSubHeader">Version 1.13.0</span>

source: <span>Options to warn before closing windows</span>
fr: <span>Options d'avertissement avant la fermeture de fenêtres</span>

source: <span>Use -T instead of -t to set title (for x-terminal-emulator)</span>
fr: <span>Utilise -T au lieu de -t pour déterminer le titre (pour x-terminal-emulator)</span>

source: <span>New --tab option</span>
fr: <span>Nouvelle option --tab</span>

source: <span>Man pages are in main distribution instead of Debian only</span>
fr: <span>Les pages de man sont dans la distribution principale et non plus seulement dans Debian</span>

source: <span class="newsItemHeader">2008-05-20</span> <span class="newsItemSubHeader">Version 1.12.0</span>
fr: <span class="newsItemHeader">20-05-2008</span> <span class="newsItemSubHeader">Version 1.12.0</span>

source: <span>i18n support</span>
fr: <span>Support de i18n</span>

source: <span>Fixed command line parsing</span>
fr: <span>Correction de l'analyse de la ligne de commande</span>

source: <span>"Hidden" tabs option</span>
fr: <span>Option d'onglets "Cachés"</span>

source: <span>--title option</span>
fr: <span>Option --title</span>

source: <span class="newsItemHeader">2008-03-27</span> <span class="newsItemSubHeader">Version 1.11.0</span>
fr: <span class="newsItemHeader">27-03-2008</span> <span class="newsItemSubHeader">Version 1.11.0</span>

source: <span>Fixed and improved colour scheme dialog</span>
fr: <span>Correction et amélioration de la fenêtre des jeux de couleurs</span>

source: <span>Terminal title bar string can be customised</span>
fr: <span>La chaîne de titre du terminal peut être personnalisée</span>

source: <span class="newsItemHeader">2007-12-31</span> <span class="newsItemSubHeader">Version 1.9.0</span>
fr: <span class="newsItemHeader">31-12-2007</span> <span class="newsItemSubHeader">Version 1.9.0</span>

source: <span>Enhanced tab options (mostly thanks to Sven Schnelle)</span>
fr: <span>Options d'onglets améliorées (la plupart grâce à Sven Schnelle)</span>

source: <span class="newsItemHeader">2007-09-11</span> <span class="newsItemSubHeader">Version 1.7.0</span>
fr: <span class="newsItemHeader">11-09-2007</span> <span class="newsItemSubHeader">Version 1.7.0</span>

source: <span>Added zoom and fullscreen facilities</span>
fr: <span>Ajout des facilités de zoom et de plein écran</span>

source: <span>New windows/tabs have same cwd as the terminal they're opened from</span>
fr: <span>Les nouvelles fenêtres/onglets ont le même cwd que le terminal depuis lequel ils sont ouverts</span>

source: <span>Official Debian packages are available for 1.5.2 onwards instead of my unofficial ones</span>
fr: <span>Les paquets officiels Debian sont disponibles pour la version 1.5.2 et suivantes plutôt que mes paquets non officiels</span>

source: <span>CLI options have changed</span>
fr: <span>Les options de CLI ont changé</span>

source: <span class="newsItemHeader">2007-08-22</span> <span class="newsItemSubHeader">Version 1.6.0</span>
fr: <span class="newsItemHeader">22-08-2007</span> <span class="newsItemSubHeader">Version 1.6.0</span>

source: <span>Many messages are now shown in dialog boxes instead of logged to console</span>
fr: <span>Beaucoup de messages sont maintenant affichés dans des boîtes de dialogue plutôt que d'être renvoyés dans la console</span>

source: <span class="newsItemHeader">2007-03-23</span> <span class="newsItemSubHeader">Version 1.5.1</span>
fr: <span class="newsItemHeader">23-03-2007</span> <span class="newsItemSubHeader">Version 1.5.1</span>

source: <span>Debianised</span>
fr: <span>Debianisé</span>

source: <span class="newsItemHeader">2006-07-05</span> <span class="newsItemSubHeader">Version 1.2.0</span>
fr: <span class="newsItemHeader">05-07-2006</span> <span class="newsItemSubHeader">Version 1.2.0</span>

source: <span>Encodings are a separate family of settings instead of being part of a profile</span>
fr: <span>Les encodages sont dans une famille de paramètres séparée plutôt que d'être intégrés à un profil</span>

source: <span class="newsItemHeader">2006-06-20</span> <span class="newsItemSubHeader">Version 1.1.0</span>
fr: <span class="newsItemHeader">20-06-2006</span> <span class="newsItemSubHeader">Version 1.1.0</span>

source: <span>Much improved drag &amp; drop support</span>
fr: <span>Support du glisser &amp; déposer nettement amélioré</span>

source: <span>Runs all terminals in a single process by default</span>
fr: <span>Par défaut, exécute tous les terminal's dans un processus unique</span>

source: <span class="newsItemHeader">2006-05-30</span> <span class="newsItemSubHeader">Version 1.0.3</span>
fr: <span class="newsItemHeader">30-05-2006</span> <span class="newsItemSubHeader">Version 1.0.3</span>

source: <span class="newsItemHeader">2006-04-29</span>
fr: <span class="newsItemHeader">29-04-2006</span>

source: <span class="newsItemHeader">2006-02-27</span>
fr: <span class="newsItemHeader">27-02-2006</span>

source: <span class="newsItemHeader">2006-02-27</span> <span class="newsItemSubHeader">Version 0.11.0</span>
fr: <span class="newsItemHeader">27-02-2006</span> <span class="newsItemSubHeader">Version 0.11.0</span>

source: <span class="newsItemHeader">2006-02-26</span> <span class="newsItemSubHeader">Version 0.10.14</span>
fr: <span class="newsItemHeader">26-02-2006</span> <span class="newsItemSubHeader">Version 0.10.14</span>

source: <span class="newsItemHeader">2006-02-25</span> <span class="newsItemSubHeader">Version 0.10.11</span>
fr: <span class="newsItemHeader">25-02-2006</span> <span class="newsItemSubHeader">Version 0.10.11</span>

source: <span class="newsItemHeader">2005-07-07</span> <span class="newsItemSubHeader">Version 0.9.7</span>
fr: <span class="newsItemHeader">07-07-2005</span> <span class="newsItemSubHeader">Version 0.9.7</span>

source: <span>The profile editor dialogue is just about complete, including keyboard shortcuts, but not yet tooltips (tomorrow)</span>
fr: <span>Le dialogue de l'éditeur de profil est presque complet, y compris pour les raccourcis clavier, mais pas encore pour les bulles d'aide (demain)</span>

source: <span class="newsItemHeader">2005-06-05</span>
fr: <span class="newsItemHeader">05-06-2005</span>

source: <span class="newsItemHeader">2005-04-06</span>
fr: <span class="newsItemHeader">06-04-2005</span>

source: <span>Now installs correctly when not using ROX</span>
fr: <span>S'installe maintenant correctement quand on n'utilise pas ROX</span>

source: <span class="newsItemHeader">2005-04-05</span>
fr: <span class="newsItemHeader">05-04-2005</span>

source: <span class="newsItemHeader">2005-04-04</span>
fr: <span class="newsItemHeader">04-04-2005</span>

source: <span class="newsItemHeader">2005-04-02</span>
fr: <span class="newsItemHeader">02-04-2005</span>

source: <span class="newsItemHeader">2004-11-28</span>
fr: <span class="newsItemHeader">28-11-2004</span>

source: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Donate</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">Valid XHTML</a>
fr: <a id="DonationLink" class="spriteLink" href="http://sourceforge.net/donate/index.php?group_id=124080">Faire un don</a> <a id="ValidMarkupLink" class="spriteLink" href="http://validator.w3.org/check?uri=referer">XHTML valide</a>

source: ROXTerm is licensed under the <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site design by Adrian Sampson
fr: ROXTerm est publié sous licence <a href="http://www.gnu.org/licenses/gpl-3.0-standalone.html">GPL</a> | Site conçu par Adrian Sampson
