Repository: realh/roxterm
Catalog: po4a/roxterm.1.*.po
Languages: fr

source: <date>01 April 2013</date>
fr: <date>1er April 2013</date>

source: en
fr: fr

source: <placeholder type="address" id="0"/> <author> <contrib>Developer</contrib> &dhfirstname; &dhsurname; </author> <copyright> <year>2005-2015</year> <holder>&dhusername;</holder> </copyright> &dhdate;
fr: <placeholder type="address" id="0"/> <author> <contrib>Développeur</contrib> &dhfirstname; &dhsurname; </author> <copyright> <year>2005-2015</year> <holder>&dhusername;</holder> </copyright> &dhdate;

source: User Commands
fr: Commandes utilisateur

source: terminal emulator
fr: émulateur de terminal

source: <command>&dhpackage;</command> <arg><option>-?</option> | <option>--help</option></arg> <arg><option>--help-all</option></arg> <arg><option>--help-gtk</option></arg> <arg><option>-u</option> | <option>--usage</option></arg> <arg><option>--geometry=<replaceable>GEOM</replaceable></option></arg> <arg><option>--appdir=<replaceable>DIR</replaceable></option></arg> <arg><option>--profile=<replaceable>PROFILE</replaceable></option> | <option>-p <replaceable>PROFILE</replaceable></option></arg> <arg><option>--colour-scheme=<replaceable>SCHEME</replaceable></option> | <option>--color-scheme=<replaceable>SCHEME</replaceable></option> | <option>-c <replaceable>SCHEME</replaceable></option></arg> <arg><option>--shortcut-scheme=<replaceable>SCHEME</replaceable></option> | <option>-s <replaceable>SCHEME</replaceable></option></arg> <arg><option>--separate</option></arg> <arg><option>--replace</option></arg> <arg><option>--fork</option></arg> <arg><option>--directory=<replaceable>DIR</replaceable></option> | <option>-d <replaceable>DIR</replaceable></option></arg> <arg><option>--show-menubar</option></arg> <arg><option>--hide-menubar</option></arg> <arg><option>--fullscreen</option><option>-f</option></arg> <arg><option>--disable-sm</option></arg> <arg><option>--tab</option></arg> <arg><option>--zoom=<replaceable>ZOOM</replaceable></option> | <option>-z <replaceable>ZOOM</replaceable></option></arg> <arg><option>--title=<replaceable>TITLE</replaceable></option> | <option>-T <replaceable>TITLE</replaceable></option></arg> <arg><option>--tab-name=<replaceable>NAME</replaceable></option> | <option>-n <replaceable>NAME</replaceable></option></arg> <arg><option>--role=<replaceable>ROLE</replaceable></option></arg> <arg><option>--execute <replaceable>COMMAND</replaceable></option> | <option>-e <replaceable>COMMAND</replaceable></option></arg>
fr: <command>&dhpackage;</command> <arg><option>-?</option> | <option>--help</option></arg> <arg><option>--help-all</option></arg> <arg><option>--help-gtk</option></arg> <arg><option>-u</option> | <option>--usage</option></arg> <arg><option>--geometry=<replaceable>GÉOMÉTRIE</replaceable></option></arg> <arg><option>--appdir=<replaceable>RÉP</replaceable></option></arg> <arg><option>--profile=<replaceable>PROFIL</replaceable></option> | <option>-p <replaceable>PROFIL</replaceable></option></arg><arg><option>--colour-scheme=<replaceable>CLRS</replaceable></option> | <option>--color-scheme=<replaceable>CLRS</replaceable></option> | <option>-c <replaceable>CLRS</replaceable></option></arg><arg><option>--shortcut-scheme=<replaceable>RACCOURCIS</replaceable></option> | <option>-s <replaceable>RACCOURCIS</replaceable></option></arg> <arg><option>--separate</option></arg> <arg><option>--replace</option></arg> <arg><option>--fork</option></arg> <arg><option>--directory=<replaceable>RÉP</replaceable></option> | <option>-d <replaceable>RÉP</replaceable></option></arg> <arg><option>--show-menubar</option></arg> <arg><option>--hide-menubar</option></arg> <arg><option>--fullscreen</option><option>-f</option></arg> <arg><option>--disable-sm</option></arg> <arg><option>--tab</option></arg> <arg><option>--zoom=<replaceable>ZOOM</replaceable></option> | <option>-z <replaceable>ZOOM</replaceable></option></arg> <arg><option>--title=<replaceable>TITRE</replaceable></option> | <option>-T <replaceable>TITRE</replaceable></option></arg> <arg><option>--tab-name=<replaceable>NOM</replaceable></option> | <option>-n <replaceable>NOM</replaceable></option></arg> <arg><option>--role=<replaceable>RÔLE</replaceable></option></arg> <arg><option>--execute <replaceable>COMMANDE</replaceable></option> | <option>-e <replaceable>COMMANDE</replaceable></option></arg>

source: This manual page documents briefly the <command>&dhpackage;</command> command.
fr: Cette page de manuel documente brièvement la commande <command>&dhpackage;</command>.

source: <command>&dhpackage;</command> is a terminal emulator.
fr: <command>&dhpackage;</command> est un émulateur de terminal.

source: These programs follow the usual &gnu; command line syntax, with long options starting with two dashes (`-'). A summary of options is included below.
fr: Ces programmes suivent la syntaxe habituelle &gnu; de la ligne de commande, avec des options longues commençant par deux tirets (`-'). Un résumé des options est inclus ci-dessous.

source: Show description of options.
fr: Afficher la description des options.

source: Show all options.
fr: Afficher toutes les options.

source: Show all GTK+ options.
fr: Afficher toutes les options GTK+.

source: Show summary of usage.
fr: Afficher le résumé de l'utilisation.

source: <option>-d <replaceable>DIRECTORY</replaceable></option> <option>--directory=<replaceable>DIRECTORY</replaceable></option>
fr: <option>-d <replaceable>RÉPERTOIRE</replaceable></option> <option>--directory=<replaceable>RÉPERTOIRE</replaceable></option>

source: Run shell/command in <replaceable>DIRECTORY</replaceable>.
fr: Exécuter la commande shell dans le<replaceable> RÉPERTOIRE</replaceable> .

source: <option>--geometry=<replaceable>GEOMETRY</replaceable></option>
fr: <option>--geometry=<replaceable>GÉOMÉTRIE</replaceable></option>

source: Set size and/or position of terminal according to X geometry specification.
fr: Régler la taille et / ou la position du terminal suivant les spécifications de la géométrie d'X.

source: <option>--appdir=<replaceable>DIR</replaceable></option>
fr: <option>--appdir=<replaceable>RÉP</replaceable></option>

source: Application directory when run as a ROX app.
fr: Réperoire d'applications quand est lancé comme une application ROX.

source: Whether to show or hide the menubar, overriding the profile. The default is to show it.
fr: Que ce soit pour afficher ou masquer la barre de menus, modifier le profil. La valeur par défaut est de l'afficher.

source: Make initial terminal window take up the whole screen with no window furniture.
fr: Faire que la fenêtre initiale du terminal occupe tout l'écran sans marque de fenêtre.

source: Disable session management.
fr: Désactiver la gestion de session.

source: If possible open the new terminal in an existing window rather than open a new window. If used in conjunction with <option>-T</option>/<option>--title</option> the tab will be placed in an existing window with the same title template if one exists. This option overrides <option>--zoom</option> and <option>--fullscreen</option>.
fr: Si cela est possible, ouvre le nouveau terminal dans une fenêtre existante au lieu de l'ouvrir dans une nouvelle fenêtre. Utilisé avec <option>-T</option>/<option>--title</option> l'onglet sera placé dans une fenêtre existante suivant le même modèle de titre s'il en existe une. Cette option a la préséance sur <option>--zoom</option> et <option>--fullscreen</option>.

source: Scale terminal's font by a factor of ZOOM (1.0 is normal size).
fr: Échelonner la police de terminal par un facteur de zoom (1.0 est la taille normale).

source: <option>-p <replaceable>PROFILE</replaceable></option> <option>--profile=<replaceable>PROFILE</replaceable></option>
fr: <option>-p <replaceable>PROFIL</replaceable></option> <option>--profile=<replaceable>PROFIL</replaceable></option>

source: Use the named profile.
fr: Utilisez le profil nommé.

source: <option>-c <replaceable>SCHEME</replaceable></option> <option>--colour-scheme=<replaceable>SCHEME</replaceable></option> <option>--color-scheme=<replaceable>SCHEME</replaceable></option>
fr: <option>-c <replaceable>JEU DE COULEURS</replaceable></option> <option>--colour-scheme=<replaceable>JEU DE COULEURS</replaceable></option> <option>--color-scheme=<replaceable>JEU DE COULEURS</replaceable></option>

source: Use the named colour scheme.
fr: Utilisez le jeu de couleurs nommé.

source: <option>-s <replaceable>SCHEME</replaceable></option> <option>--shortcut-scheme=<replaceable>SCHEME</replaceable></option>
fr: <option>-s <replaceable>JEU DE RACCOURCIS CLAVIER</replaceable></option> <option>--shortcut-scheme=<replaceable>JEU DE RACCOURCIS CLAVIER</replaceable></option>

source: Use the named keyboard shortcut scheme.
fr: Utilisez le jeu de raccourcis clavier nommé.

source: <option>--title=<replaceable>TITLE</replaceable></option> <option>-T <replaceable>TITLE</replaceable></option>
fr: <option>--title=<replaceable>TITRE</replaceable></option> <option>-T <replaceable>TITRE</replaceable></option>

source: Set window title template. May include "%s" which is substituted with the full contents of the tab's label.
fr: Sélectionner le modèle de titre des fenêtres. Peut inclure "%s" qui est remplacé par l'intégralité du contenu des étiquettes de l'onglet.

source: <option>--tab-name=<replaceable>NAME</replaceable></option> <option>-n <replaceable>NAME</replaceable></option>
fr: <option>--tab-name=<replaceable>NOM</replaceable></option> <option>-n <replaceable>NOM</replaceable></option>

source: Set tab name as displayed in its label. May include "%s" which is substituted with the window title string set by the terminal.
fr: Définir le nom de l'onglet tel qu'affiché dans son l'étiquette. Peut inclure "%s" qui est remplacé par la chaîne de titre de la fenêtre sélectionnée par le terminal.

source: Use a separate process for this terminal.
fr: Utiliser un processus distinct pour ce terminal.

source: Always fork into the background. Usually the first instance stays in the foreground and subsequent invocations return once they have asked the master instance to handle their command. This option causes the master instance to fork itself into the background; the foreground process returns once the master is ready to handle further commands.
fr: Toujours forker en arrière-plan. Habituellement la première instance reste au premier plan et les invocations suivantes se terminent une fois qu'elle ont demandé à l'instance maîtresse de traiter leurs commandes. Cette option force l'instance maîtresse à se forker elle-même en arrière-plan ; le processus au premier plan se termine lorsque le maître est prêt à traiter les commandes suivantes.

source: Replace any existing instance as ROXTerm D-BUS service provider.
fr: Remplacer toute instance existante du service D-BUS de ROXTerm.

source: <option>--role=<replaceable>ROLE</replaceable></option>
fr: <option>--role=<replaceable>RÔLE</replaceable></option>

source: Sets the X window system "role" hint for the window being created.
fr: Définit le "rôle" du système de fenêtrage X conseillé pour la fenêtre en cours de création.

source: Execute remainder of the command line inside the terminal. Must be the final option. If there is only one following argument it is parsed in case it is a command with space-separated arguments that was passed to roxterm in quotes. If there is more than one argument they are treated as a command and arguments without parsing.
fr: Exécuter le reste de la ligne de commande dans le terminal. Doit être la dernière option. S'il n'y a qu'un seul argument, il est analysé au cas où il s'agirait d'une commande avec des arguments séparés par un espace qui a été transmise à roxterm entre guillemets. S'il y a plus d'un argument, ils sont traités comme une commande et les arguments ne sont pas analysés.

source: SEE ALSO
fr: VOIR AUSSI

source: The program is documented fully by the HTML file <filename>file://@htmldir@/en/index.html</filename>.
fr: Le programme est entièrement documenté avec le fichier HTML <filename> file://@htmldir@/fr/index.html </filename> .

source: AUTHOR
fr: AUTEUR

source: This manual page was written by &dhusername; &dhemail;. Permission is granted to copy, distribute and/or modify this document under the terms of the &gnu; General Public License, Version 2 or any later version published by the Free Software Foundation.
fr: Cette page de manuel a été écrite par &dhusername; &dhemail;. Permission accordé de copier, distribuer et/ou modifier ce document selon les termes de la licence &gnu; General Public License, Version 2 ou toute version ultérieure publiée par la Free Software Foundation.

source: On Debian systems, the complete text of the GNU General Public License can be found in /usr/share/common-licenses/GPL.
fr: Sur les systèmes Debian, le texte complet de la GNU General Public License peut être trouvé à l'adresse /usr/share/common-licenses/GPL.
